#!/bin/zsh
#
# .zsh_plugins.txt - antidote plugins file
#

# oh-my-zsh framework
getantidote/use-omz
ohmyzsh/ohmyzsh path:lib

# custom plugins
adamancini/oh-my-replicated path:replicated-awscommands.plugin.zsh branch:main
adamancini/oh-my-replicated path:replicated-gcommands.plugin.zsh branch:main

# OMZ plugins
ohmyzsh/ohmyzsh path:plugins/aws
ohmyzsh/ohmyzsh path:plugins/docker
ohmyzsh/ohmyzsh path:plugins/docker-compose
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/github
ohmyzsh/ohmyzsh path:plugins/gitignore
ohmyzsh/ohmyzsh path:plugins/history
ohmyzsh/ohmyzsh path:plugins/man
ohmyzsh/ohmyzsh path:plugins/mosh
ohmyzsh/ohmyzsh path:plugins/nmap
ohmyzsh/ohmyzsh path:plugins/pass kind:fpath
ohmyzsh/ohmyzsh path:plugins/tmux
ohmyzsh/ohmyzsh path:plugins/z

# prompt theme (needed immediately)
romkatv/powerlevel10k

# deferred: completion enhancer (only needed on Tab)
aloxaf/fzf-tab kind:defer

# deferred: cd enhancement
skywind3000/z.lua kind:defer

# deferred: ls colors
joel-porquet/zsh-dircolors-solarized kind:defer

# deferred: fish-like features (load after prompt is up)
# order matters: syntax-highlighting before history-substring-search
zsh-users/zsh-autosuggestions kind:defer
zsh-users/zsh-syntax-highlighting kind:defer
zsh-users/zsh-history-substring-search post:hss-bindkey kind:defer

# macOS-only plugins
ohmyzsh/ohmyzsh path:plugins/brew conditional:'[[ "$(uname -s)" == "Darwin" ]]' kind:defer
ohmyzsh/ohmyzsh path:plugins/macos conditional:'[[ "$(uname -s)" == "Darwin" ]]' kind:defer
