# Complete Brewfile - All packages across all machines
tap "amar1729/formulae"
tap "buo/cask-upgrade"
tap "charmbracelet/tap"
tap "fluxcd/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "k0sproject/tap"
tap "nikitabobko/tap"
tap "norwoodj/tap"
tap "replicatedhq/replicated"
tap "shellspec/shellspec"
tap "weaveworks/tap"

brew "act"
brew "ansible"
brew "ansible-lint"
brew "awscli"
brew "bash-language-server"
brew "coreutils"
brew "curl"
brew "dagger"
brew "direnv"
brew "docutils"
brew "eslint"
brew "ffmpeg"
brew "fswatch"
brew "gh"
brew "github-keygen"
brew "gnu-sed"
brew "gnupg"
brew "gnutls"
brew "go"
brew "go-task"
brew "graphviz"
brew "helix"
brew "helm"
brew "helmfile"
brew "htop"
brew "hub"
brew "jq"
brew "k3d"
brew "k9s"
brew "keychain"
brew "kompose"
brew "krew"
brew "kubecm"
brew "kubeconform"
brew "kubent"
brew "kubernetes-cli"
brew "kubeseal"
brew "libidn2"
brew "lnav"
brew "lua"
brew "mas"
brew "mosh"
brew "mtr"
brew "ncc"
brew "ncdu"
brew "neovim"
brew "node"
brew "pass"
brew "pinentry-mac"
brew "podman"
brew "python@3.10"
brew "python@3.9"
brew "rulesync"
brew "shellcheck"
brew "shellspec"
brew "stern"
brew "telnet"
brew "the_silver_searcher"
brew "tilt"
brew "tmux"
brew "trivy"
brew "unbound"
brew "vim"
brew "watch"
brew "wget"
brew "wireguard-tools"
brew "yadm"
brew "yaml-language-server"
brew "yamllint"
brew "yarn"
brew "ykman"
brew "yq"
brew "yt-dlp"
brew "zsh"
brew "amar1729/formulae/browserpass"
brew "charmbracelet/tap/crush"
brew "fluxcd/tap/flux"
brew "k0sproject/tap/k0sctl"
brew "norwoodj/tap/helm-docs"
brew "replicatedhq/replicated/cli"
brew "weaveworks/tap/gitops"

cask "aerospace"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-ss04"
cask "font-iosevka-term-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "gcloud-cli"
cask "google-cloud-sdk"
cask "gstreamer-runtime"
cask "klogg"
cask "opcode"
cask "openlens"
cask "podman-desktop"
cask "rar"
cask "vagrant"
cask "visual-studio-code"
cask "wireshark-app"

mas "AutoMounter", id: 1160435653
mas "CrystalFetch", id: 6454431289
mas "GoodNotes", id: 1444383602
mas "Goodnotes", id: 1444383602
mas "GrandPerspective", id: 1111570163
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "NordVPN", id: 905953485
mas "Notability", id: 360593530
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Twingate", id: 1501592214

vscode "4ops.packer"
vscode "anggiarlandi.vscode-open-in-github"
vscode "anthropic.claude-code"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "davidanson.vscode-markdownlint"
vscode "DavidAnson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "github.codespaces"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "googlecloudtools.cloudcode"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "jq-syntax-highlighting.jq-syntax-highlighting"
vscode "kodu-ai.claude-dev-experimental"
vscode "mindaro-dev.file-downloader"
vscode "mindaro.mindaro"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.sublime-keybindings"
vscode "okteto.kubernetes-context"
vscode "Okteto.kubernetes-context"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "silesky.toggle-boolean"
vscode "supermaven.supermaven"
vscode "sysoev.vscode-open-in-github"
vscode "timonwong.shellcheck"
vscode "unifiedjs.vscode-mdx"
vscode "vscodevim.vim"
vscode "weaveworks.vscode-gitops-tools"

go "chainguard.dev/apko"
go "k8s.io/code-generator/cmd/client-gen"
go "sigs.k8s.io/controller-tools/cmd/controller-gen"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/onsi/ginkgo/v2/ginkgo"
go "golang.org/x/tools/gopls"
go "sigs.k8s.io/kind"
go "honnef.co/go/tools/cmd/staticcheck"
