tap "amar1729/formulae"
tap "buo/cask-upgrade"
tap "fluxcd/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "k0sproject/tap"
tap "norwoodj/tap"
tap "replicatedhq/replicated"
tap "weaveworks/tap"
brew "ansible"
brew "yamllint"
brew "ansible-lint"
brew "docutils"
brew "awscli"
brew "coreutils"
brew "libidn2"
brew "curl"
brew "direnv"
brew "unbound"
brew "gnutls"
brew "ffmpeg"
brew "gh"
brew "github-keygen"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "graphviz"
brew "helm"
brew "htop"
brew "hub"
brew "jq"
brew "k3d"
brew "k9s"
brew "keychain"
brew "kubecm"
brew "kubernetes-cli"
brew "kubeseal"
brew "lnav"
brew "lua"
brew "mas"
brew "mosh"
brew "mtr"
brew "neovim"
brew "node"
brew "pass"
brew "pinentry-mac"
brew "python@3.10"
brew "python@3.9"
brew "stern"
brew "telnet"
brew "tilt"
brew "tmux"
brew "vim"
brew "watch"
brew "wget"
brew "yadm"
brew "yarn"
brew "yt-dlp"
brew "zsh"
brew "amar1729/formulae/browserpass"
brew "fluxcd/tap/flux"
brew "k0sproject/tap/k0sctl"
brew "norwoodj/tap/helm-docs"
brew "replicatedhq/replicated/cli"
brew "weaveworks/tap/gitops"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-ss04"
cask "font-iosevka-term-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "google-cloud-sdk"
cask "gstreamer-runtime"
cask "openlens"
cask "rar"
mas "BetterSnapTool", id: 417375580
mas "GarageBand", id: 682658836
mas "GoodNotes", id: 1444383602
mas "GrandPerspective", id: 1111570163
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "NordVPN", id: 905953485
mas "Notability", id: 360593530
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
vscode "4ops.packer"
vscode "anggiarlandi.vscode-open-in-github"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "DavidAnson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "googlecloudtools.cloudcode"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "jq-syntax-highlighting.jq-syntax-highlighting"
vscode "mindaro-dev.file-downloader"
vscode "mindaro.mindaro"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.sublime-keybindings"
vscode "Okteto.kubernetes-context"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "silesky.toggle-boolean"
vscode "sysoev.vscode-open-in-github"
vscode "timonwong.shellcheck"
vscode "unifiedjs.vscode-mdx"
vscode "vscodevim.vim"
vscode "weaveworks.vscode-gitops-tools"
